Tekla.Structures.Model.ModelObject.SetLabel(System.String)
Sets a label for an object when a new instance is created.
The label is used in plug-ins for identifying the changed object in modification.
label: The label to set to the model object.
Returns: True on success.